In [100]:
import pandas as pd

In [112]:
df = pd.read_excel('5.-Jumbled-up-Customers-Details.xlsx')
df

                                                Name  Address  Age  Gender
0  Name Hussein Hakeem Address Number 22 Fioye Cr...      NaN  NaN     NaN
1  Name Arojoye Samuel Address 11 Omolade Close O...      NaN  NaN     NaN
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...      NaN  NaN     NaN
3  Name Susan Nwaimo Address Number 58 Yaba Stree...      NaN  NaN     NaN
4  Name Ajao Opeyemi Address No12 Olubunmi Street...      NaN  NaN     NaN
5  Name Banjoko Adebusola Address 34 Ngige Street...      NaN  NaN     NaN
6  Name Muhammed Olabisi Address 13, ICAN road, E...      NaN  NaN     NaN
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...      NaN  NaN     NaN

In [113]:
df.columns

Index(['Name', 'Address', 'Age', 'Gender'], dtype='object')

#### Issue 1

In [114]:
# Converting all the header name into lower case
df.columns = [x.lower() for x in df.columns]

In [115]:
df

                                                name  address  age  gender
0  Name Hussein Hakeem Address Number 22 Fioye Cr...      NaN  NaN     NaN
1  Name Arojoye Samuel Address 11 Omolade Close O...      NaN  NaN     NaN
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...      NaN  NaN     NaN
3  Name Susan Nwaimo Address Number 58 Yaba Stree...      NaN  NaN     NaN
4  Name Ajao Opeyemi Address No12 Olubunmi Street...      NaN  NaN     NaN
5  Name Banjoko Adebusola Address 34 Ngige Street...      NaN  NaN     NaN
6  Name Muhammed Olabisi Address 13, ICAN road, E...      NaN  NaN     NaN
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...      NaN  NaN     NaN

In [116]:
import re

text = 'Name Hussein Hakeem Address Number 22 Fioye Crescent Surulere Lagos Age 17 Gender Male'
name = ""
address = ""
age = ""
gender = ""
try:
    name = re.search('Name(.+?)Address', text).group(1).strip()
    print(name)

    address = re.search('Address(.+?)Age', text).group(1).strip()
    print(address)

    age = re.search('Age(.+?)Gender', text).group(1).strip()
    print(age)


    gender = text.split("Gender",1)[1].strip()
    print(gender)
except AttributeError:
    pass

Hussein Hakeem
Number 22 Fioye Crescent Surulere Lagos
17
Male

In [117]:
def get_name(item):  
    try:
        name = re.search('Name(.+?)Address', item).group(1).strip()
    except AttributeError:
        name = "" 
    return name

In [118]:
def get_address(item):
    try:
        address = re.search('Address(.+?)Age', item).group(1).strip()
    except AttributeError:
         address = ""
    return address

In [119]:
def get_age(item):
    try:
        age = re.search('Age(.+?)Gender', item).group(1).strip()
    except AttributeError:
        age = ""
    return age

In [120]:
def get_gender(item):
    try:
        gender = text.split("Gender",1)[1].strip()
    except AttributeError:
        gender = ""
    return gender

In [121]:
df['address'] = df['name'].apply(get_address)
df['age'] = df['name'].apply(get_age)
df['gender'] = df['name'].apply(get_gender)
df['name'] = df['name'].apply(get_name)

In [122]:
df

                  name                                  address age gender
0       Hussein Hakeem  Number 22 Fioye Crescent Surulere Lagos  17   Male
1       Arojoye Samuel      11 Omolade Close Omole Estate Lagos  16   Male
2          Alex Ezurum                      1 Adamu Lane, Abuja  14   Male
3         Susan Nwaimo      Number 58 Yaba Street, Kaduna State  16   Male
4         Ajao Opeyemi           No12 Olubunmi Street, Abeokuta  18   Male
5    Banjoko Adebusola           34 Ngige Street, Ugheli, Delta  14   Male
6     Muhammed Olabisi                     13, ICAN road, Enugu  12   Male
7  Oluwagbemi Mojisola                       ACCA Lane, Onitsha  13   Male